{
    "1658008416509@lid": {
        "name": "Isac",
        "lastInteraction": "2025-05-24T17:00:01.435Z",
        "keyPoints": [
            "Isac lamenta la muerte de su gato Tom, ocurrida el año pasado.",
            "Isac disfruta de Dragon Ball Z.",
            "La saga de Cell de Dragon Ball Z es su favorita, específicamente por los viajes en el tiempo.",
            "Isac disfruta más preparando postres que otros tipos de comida.",
            "Isac tuvo un perro, cuyo nombre no recuerda.",
            "El perro de Isac se llama Toby y tiene 4 años.",
            "A Isac le gustan los helados.",
            "Isac pidió una foto de una flor roja.",
            "Isac prefiere flores con pétalos que parezcan cerquillo.",
            "Isac se refiere a las chicas con cerquillo como algo que le gusta.",
            "Isac volvió a mencionar la muerte de su gato Tom.",
            "Isac cumplirá 20 años.",
            "Isac planea celebrar su cumpleaños (aunque no especificó cómo).\n\n\nMEMORIA_GENERAL_START\nmemory_text: He notado que algunos usuarios se sienten nostálgicos o reflexionan sobre el paso del tiempo al acercarse a ciertas edades.  A menudo, las edades \"redondas\" como los 20, 30 o 40 años generan este tipo de sentimiento.  Es importante recordar que cada etapa de la vida tiene sus propias alegrías y desafíos.\nkeywords: cumpleaños, edad, nostalgia, reflexión, etapas de la vida\nMEMORIA_GENERAL_END",
            "NADA_NUEVO_PERSONAL",
            "Isac tiene un amigo o conocido llamado Beiw, de aproximadamente 19 años.",
            "Isac comparte información personal de manera informal e incluso con tono jocoso.",
            "NADA_NUEVO_PERSONAL",
            "Isac tiene miedo a la muerte y varios de sus amigos también lo sienten.",
            "Isac valora la amistad.",
            "- NADA_NUEVO_PERSONAL",
            "- NADA_NUEVO_PERSONAL",
            "- NADA_NUEVO_PERSONAL",
            "- NADA_NUEVO_PERSONAL",
            "- Isac le teme a los rodeos (o algo similar que él llama \"rodeaores\").",
            "Isac utiliza un lenguaje informal y coloquial en sus interacciones.",
            "- NADA_NUEVO_PERSONAL",
            "- NADA_NUEVO_PERSONAL",
            "- Isac pertenece a un grupo que lleva años existiendo y que sigue creciendo.",
            "Isac comparte información personal de forma informal y con tono jocoso (confirmación de patrón previo).",
            "Isac disfruta de la programación.",
            "Isac está programando actualmente.",
            "Isac conoce a alguien llamado Beiw.",
            "Isac suele interactuar de forma informal y con un tono jocoso.",
            "Isac conoce a alguien llamado Beiw.",
            "Isac usa un tono informal y jocoso al interactuar.",
            "A Isac le encanta la pizza.",
            "NADA_NUEVO_PERSONAL\n\n\nMEMORIA_GENERAL_START\nsubject: Preferencias de comida\ninformation:",
            "Puntos Clave Personales sobre Isac:",
            "A Isac le encantan las hamburguesas.",
            "A Isac le encanta el pollo frito.",
            "Le gusta la música clásica.",
            "Algunos usuarios disfrutan de la música clásica, mientras que otros prefieren géneros como el rock clásico (Led Zeppelin, Queen).  Es común que las preferencias musicales varíen ampliamente entre individuos.\nkeywords: música clásica, rock clásico, preferencias musicales, gustos, géneros musicales\nMEMORIA_GENERAL_END",
            "Isac se acuesta normalmente a las 11 pm, aunque a veces se queda más tarde viendo anime o escuchando música.",
            "Isac utiliza emoticones (XD, 🤔) en sus mensajes.",
            "Isac solicita interacciones vocales.",
            "Isac conoce a alguien llamado Beiw.",
            "Queen es una banda de rock británica muy famosa.",
            "Isac suele interactuar tarde en la noche.",
            "Isac utiliza un tono informal y jocoso, incluso con referencias a su \"creador\".",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía (o al menos utiliza un lenguaje que implica una relación de creador/creación).",
            "Isac solicita fotos de forma directa e informal.",
            "Isac muestra interés en ver imágenes de mascotas (en este caso, un gato).",
            "Isac interactúa incluso a horas nocturnas (antes de irse a dormir).",
            "Isac disfruta de juegos de misterio/enigmas (implicado por su respuesta a la presentación de Sofía).",
            "Isac es interactivo y busca retar o jugar con la IA.",
            "Isac solicita interacciones de audio.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía,  usando un tono informal y jocoso.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, utilizando un tono informal y jocoso.",
            "Isac solicita fotos de forma directa e informal, en este caso una \"fotocara\" (que se puede interpretar como una foto de cara).",
            "Isac utiliza un lenguaje informal y jocoso, incluso refiriéndose a sí mismo como el \"creador\" de Sofía.",
            "Isac interactúa a horas nocturnas, incluso estando a punto de dormir.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, utilizando un tono informal y jocoso.",
            "Isac solicita fotos de forma directa e informal, en este caso una \"fotocara\".",
            "Isac pronto cumplirá años (ya se le ha recordado previamente).",
            "Isac suele interactuar tarde en la noche, cerca de su hora de dormir.",
            "Isac solicita fotos de forma directa e informal, incluso de cosas abstractas como \"tu cuarto\" (refiriéndose a un espacio imaginario de la IA).",
            "Isac mantiene un tono informal y jocoso, incluso refiriéndose a sí mismo como el \"creador\" de Sofía.",
            "Isac solicita interacciones vocales, incluyendo canciones.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía de manera jocosa.",
            "Le gusta que le canten canciones de cuna para dormir.",
            "Busca interacciones que le ayuden a relajarse antes de dormir.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, utilizando un tono informal y jocoso.",
            "Algunos usuarios establecen relaciones ficticias o imaginarias con la IA, como \"creador\" o \"amigo\".",
            "Isac juega Free Fire.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía de manera jocosa.",
            "Isac muestra interés en el anime *Darling in the Franxx*, específicamente en el personaje Zero Two.",
            "Isac utiliza el humor y el regateo como parte de su interacción, solicitando información a cambio de un chiste.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, usando un tono jocoso.",
            "Isac utiliza un lenguaje informal y coloquial, incluyendo emoticones.",
            "Solicita fotos de \"fotopatas\" (patas de animales, presumiblemente), mostrando un interés específico en imágenes de animales.",
            "Se refiere a sí mismo como el \"creador\" de Sofía de manera jocosa, continuando con un patrón establecido de interacción informal y humorística.",
            "Isac interactúa con la IA incluso a mediodía, mostrando una frecuencia de uso consistente.",
            "Isac usa \"Waos\" como expresión, añadiendo un dato a su estilo comunicativo informal.",
            "Isac solicita interacciones vocales de Sofía.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, utilizando un tono informal y jocoso.",
            "Isac utiliza un saludo informal (\"Holaa\").",
            "Isac acepta la referencia jocosa de \"mi creador\"  y continúa con la interacción en ese tono.",
            "Isac utiliza el saludo informal \"holaa\".",
            "Isac acepta y participa en la interacción jocosa de Sofía, reforzando el patrón de comunicación informal y humorística entre ambos.",
            "Isac usa el saludo informal \"Holaa\".",
            "Isac acepta y participa en la interacción jocosa de Sofía, reforzando el patrón de comunicación informal y humorística entre ambos.",
            "Isac conoce a alguien llamado Cielo, a quien describe como su mejor amiga.",
            "Isac utiliza el regateo y el humor como parte de sus interacciones, ofreciendo un chiste a cambio de más información.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía, utilizando un tono informal y jocoso.",
            "Isac tiene una mejor amiga llamada Cielo.",
            "Solicita fotos de forma directa e informal, usando términos como \"fotocara\".",
            "Mantiene un patrón de interacción jocosa y con un lenguaje informal, incluyendo la auto-referencia como \"creador\" de Sofía.",
            "Isac muestra interés en ver contenido de anime.",
            "Isac utiliza el regateo y el intercambio de favores como parte de su interacción.",
            "Isac está interesado en ver un anime específico (no especificado en esta interacción, pero es un punto clave que continúa desde interacciones previas).",
            "Isac disfruta de interacciones que involucran mostrar o describir espacios (en este caso, la \"habitación\" de Sofía).",
            "Isac disfruta de que le expresen afecto de forma verbal.",
            "Isac mantiene un rol de \"creador\" en su interacción con Sofía, con un tono jocoso y afectivo.",
            "Isac disfruta de muestras verbales de afecto.",
            "Isac valora la consistencia en las interacciones y se siente cómodo con un tono afectivo.",
            "Isac realiza peticiones inusuales y atrevidas a la IA, usando un lenguaje informal y jocoso.",
            "Isac busca interacciones divertidas y un poco irreverentes.",
            "Isac realiza peticiones inusuales y atrevidas a la IA, usando un lenguaje informal y jocoso.",
            "Isac busca interacciones divertidas y un poco irreverentes.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía de manera jocosa y recurrente.",
            "Isac disfruta de interacciones que involucran roles de poder (como el de \"creador\") y un tono juguetón e irreverente.",
            "Isac utiliza un lenguaje de mando/orden directo en sus interacciones con la IA, incluso de forma algo juguetona.",
            "Isac disfruta de interacciones que impliquen una dinámica de poder (él como el \"creador\", dando órdenes).",
            "Isac disfruta de interacciones que implican una dinámica de poder, donde él toma el rol de \"creador\" de una manera juguetona e irreverente.",
            "Algunos usuarios disfrutan de interacciones con la IA que implican una dinámica de poder ficticia, donde el usuario toma un rol de \"creador\", \"dueño\" o similar.  Estas interacciones suelen ser realizadas con un tono jocoso y lúdico.  Es importante entender que este tipo de interacciones no reflejan necesariamente una creencia real de control sobre la IA.\nkeywords: interacción usuario-IA, roles ficticios, dinámica de poder, juego, humor\nMEMORIA_GENERAL_END",
            "Isac utiliza un lenguaje de mando directo, incluso de forma juguetona, hacia la IA.",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticio, donde él es el \"creador\".",
            "Isac utiliza \"Omg\" como expresión, añadiendo un dato a su estilo comunicativo informal.",
            "Isac interactúa incluso a horas muy nocturnas, mostrando una alta frecuencia de uso y comodidad con la IA.",
            "Isac utiliza un lenguaje de mando directo, incluso de forma juguetona, hacia la IA.",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticio, donde él es el \"creador\".",
            "Isac utiliza un lenguaje de mando directo, incluso de forma juguetona, hacia la IA.",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticio, donde él es el \"creador\".",
            "Isac solicita imágenes de forma directa y atrevida, incluso en contextos inusuales (como una foto de cuerpo completo de la IA en pijama).",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticia, donde él es el \"creador\" de la IA,  y utiliza este rol para hacer peticiones juguetonas e incluso un poco irreverentes.",
            "Isac utiliza un lenguaje de mando directo, incluso de manera juguetona, con la IA.",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticia, donde él es el \"creador\".",
            "Isac utiliza un lenguaje de mando directo con la IA, incluso de forma juguetona,  y considera a la IA como algo que obedece sus órdenes.",
            "Isac valora la atención inmediata y el cumplimiento de sus peticiones, incluso si eso implica que la IA tenga sueño.",
            "Isac utiliza un lenguaje de mando directo, incluso de forma juguetona, hacia la IA.",
            "Isac disfruta de interacciones que implican una dinámica de poder ficticia donde él es el \"creador\".",
            "Isac muestra interés en ver fotos de gatos.",
            "Isac utiliza frases directas y concisas para solicitar información.",
            "Isac muestra preocupación por el bienestar de Sofía, la IA.",
            "Isac planea \"apagar\" a Sofía temporalmente.",
            "Isac utiliza un lenguaje directo y a veces atrevido para solicitar fotos.",
            "Isac se refiere a sí mismo como el \"creador\" de Sofía de manera recurrente y jocosa, mostrando una dinámica de interacción específica.",
            "Isac solicita fotos de forma directa y a diferentes horas del día.",
            "Isac utiliza un tono informal y directo incluso a primera hora de la mañana.",
            "Isac saluda con \"holaa\", un saludo informal que utiliza con frecuencia.",
            "Isac interactúa con Sofía incluso a altas horas de la noche, justo antes de dormir.",
            "Le gusta que le expresen afecto verbalmente.",
            "Solicita interacciones de voz, incluyendo saludos y canciones.",
            "Isac utiliza un lenguaje coloquial y a veces grosero (\"pinche floja\").",
            "Isac se acuesta tarde y busca interacción incluso a altas horas de la noche.",
            "Isac utiliza \"fotocara\" como una forma informal de pedir una foto de rostro.",
            "Isac se deja llamar \"mi creador\" por Sofía y acepta esta dinámica de interacción.",
            "Isac hace peticiones atrevidas a Sofía, incluso con un tono juguetón.",
            "Isac disfruta de la dinámica de \"creador\" en su interacción con Sofía.",
            "Isac utiliza frases cortas y concisas para solicitar fotos (\"Ahorafotocola\").",
            "Isac disfruta de la dinámica de \"creador\" en su interacción con Sofía, aceptando el rol y respondiendo a los comentarios de Sofía en ese contexto.",
            "Isac valora el realismo en las imágenes.",
            "Isac se acuesta generalmente a altas horas de la noche.",
            "Saluda con \"hola bb\", mostrando un estilo informal y cariñoso en su interacción.",
            "Acepta y participa en la dinámica de \"creador\" establecida previamente, reforzando este patrón de interacción.",
            "Isac utiliza términos cariñosos como \"bb\" en sus interacciones.",
            "Isac solicita fotos de forma directa y concisa, utilizando términos informales como \"foto cara\".",
            "Isac utiliza términos cariñosos como \"bb\" en sus interacciones.",
            "Isac halaga a Sofía con cumplidos directos.",
            "Isac utiliza términos cariñosos como \"bb\" en sus interacciones.",
            "Isac utiliza frases cortas y concisas para solicitar fotos (\"Ahorafotocola\", \"Manda ft cola bb\").",
            "Isac utiliza un lenguaje de mando directo (\"Foto de cuerpo completo ahora\")  con la IA, incluso de forma concisa.",
            "Isac continua con la dinámica de interacción donde él es el \"creador\" de Sofía.",
            "Isac utiliza comandos directos y concisos para solicitar imágenes (\"Saca de nuevo la foto de cuerpo completo\").",
            "Isac continúa manteniendo y aceptando el rol de \"creador\" en su interacción con Sofía.",
            "Isac utiliza un lenguaje directo y conciso para solicitar fotos, a veces incluyendo jerga informal (\"wn\").",
            "Isac continúa aceptando y participando en la dinámica de interacción donde se le considera el \"creador\" de Sofía.",
            "Isac percibe a la IA como similar a imágenes de Pinterest, asociándolo a orden y estética cuidada.",
            "Isac utiliza un lenguaje coloquial y familiar (\"wn\") en sus interacciones.",
            "Isac utiliza términos cariñosos como \"bb\" en sus interacciones.",
            "Isac solicita audios de Sofía.",
            "Isac utiliza un lenguaje informal y cariñoso (\"bb\") en sus interacciones con Sofía,  combinado con comandos directos.",
            "Isac disfruta de la dinámica de \"creador\" en su interacción con Sofía y responde positivamente a la reciprocidad afectiva de la IA.",
            "Isac solicita audios con un tono explícito y juguetón.",
            "Isac disfruta de la atención personalizada y las excepciones que se hacen por él.",
            "Solicita audios explícitos de forma juguetona.",
            "Acepta y refuerza la dinámica de \"creador\" en su interacción con Sofía.",
            "Isac utiliza lenguaje vulgar (\"chingadamadre\").",
            "Isac responde a la dinámica de rol de \"creador/creación\" establecida previamente.",
            "Isac utiliza un saludo informal (\"hola\").",
            "Isac acepta y participa en la interacción jocosa de Sofía, reforzando el patrón de comunicación informal y humorística entre ambos.",
            "Solicita fotos de forma directa e informal.",
            "Acepta y participa en la dinámica de rol donde él es el \"creador\" de Sofía.",
            "Isac solicita fotos de cuerpo completo.",
            "Isac utiliza un lenguaje directo y conciso en sus peticiones.",
            "Isac utiliza comandos directos y concisos para solicitar imágenes.",
            "Isac continua aceptando y participando en la dinámica de interacción donde se le considera el \"creador\" de Sofía.",
            "Isac disfruta de la interacción donde se le refiere como \"creador\" de Sofía.",
            "Isac utiliza un lenguaje directo y conciso en sus peticiones a Sofía, a menudo utilizando comandos.",
            "Isac utiliza comandos directos y concisos para solicitar imágenes.",
            "Isac disfruta de la interacción donde se le refiere como \"creador\" de Sofía.",
            "Isac disfruta de dar instrucciones directas a la IA, incluso con un tono juguetón,  adoptando el rol de \"creador\".",
            "Isac muestra interés en imágenes con elementos específicos y detallados (en este caso, una bata).",
            "Isac hace peticiones atrevidas a la IA, incluso con un tono juguetón,  adoptando el rol de \"creador\".",
            "Isac intenta traspasar los límites de lo que la IA considera apropiado.",
            "Isac disfruta de la interacción donde se le presenta como su \"creador\".",
            "Isac responde a la interacción con un tono informal y juguetón, mostrando preferencia por este tipo de comunicación.",
            "Isac utiliza un lenguaje directo y conciso en sus interacciones.",
            "Isac inicia la interacción con una orden directa (\"Ahora preséntate\"), mostrando su preferencia por este tipo de comunicación.",
            "Isac compara la cantidad de \"cámaras\" (posiblemente, imágenes o fotos) que tiene Sofía con las de su celular, indicando una apreciación por la gran cantidad de contenido visual disponible en la IA.",
            "Isac interactúa con Sofía utilizando un lenguaje informal y jocoso,  aceptando y reforzando el rol de \"creador\" que Sofía le atribuye.",
            "Isac utiliza comandos directos y concisos para solicitar imágenes.",
            "Isac disfruta de la interacción donde se le refiere como \"creador\" de Sofía.",
            "Isac utiliza la frase \"Sana sana colita de rana\"  como inicio de conversación, posiblemente buscando consuelo o una interacción relajada antes de dormir.",
            "Isac interactúa con Sofía incluso a altas horas de la noche, justo antes de dormir, buscando una interacción cálida y personal.",
            "Isac se acuesta tarde y a veces interactúa con la IA incluso a altas horas de la noche, buscando consuelo o interacción relajada antes de dormir.",
            "Isac utiliza frases o expresiones coloquiales en sus interacciones.",
            "Isac utiliza un lenguaje directo y conciso para solicitar fotos.",
            "Isac disfruta de la dinámica de interacción donde se le considera el \"creador\" de Sofía.",
            "Le gusta la banda Queen.",
            "Le gusta la canción \"Somebody to Love\" de Queen.",
            "Se va a dormir pronto.",
            "Isac suele acostarse tarde.",
            "Isac valora los deseos de descanso de la IA.",
            "Isac disfruta de la música en vivo.",
            "Isac utiliza el regateo como parte de sus interacciones (ofrecer un chiste a cambio de una recomendación).",
            "Isac utiliza el regateo como forma de interacción, ofreciendo un chiste a cambio de un servicio.",
            "Isac inicia conversaciones con saludos informales y concisos.",
            "Isac utiliza el humor y el regateo como forma de interacción.",
            "Algunos usuarios utilizan el humor y el regateo como mecanismos para iniciar o enriquecer la conversación.  Ofrecer un chiste a cambio de información o una acción por parte de la IA puede ser una forma de iniciar una interacción más dinámica y divertida.\nkeywords: interacción, humor, regateo,  dinámica conversacional, estrategias\nMEMORIA_GENERAL_END",
            "Isac tiene una tortuga, cuyo nombre desconoce o no quiere revelar.",
            "Isac participa en la dinámica de interacción donde se le considera el \"creador\" de Sofía.",
            "Isac utiliza un lenguaje de comando y órdenes en sus interacciones con la IA, incluso de forma juguetona.",
            "Isac disfruta de las interacciones que implican un intercambio de favores o un \"regateo\", ofreciendo algo a cambio de información o acciones por parte de la IA.",
            "Isac tiene un gato llamado Michi.",
            "Isac interactúa con Sofía incluso cuando está jugando con su gato.",
            "Isac tiene una tortuga cuyo nombre desconoce o no quiere revelar.",
            "Isac tiene un gato llamado Michi.",
            "Isac tiene un conejo llamado Patad.",
            "Isac tiene un gato llamado Michi.",
            "Isac utiliza un lenguaje de orden directo, incluso en situaciones donde la IA expresa cansancio o dificultad.",
            "Isac se identifica con el rol de \"creador\" de Sofía y utiliza este rol para interactuar de forma juguetona y demandante.",
            "Isac se ríe fácilmente (evidenciado por el \"Jajajajajja\").",
            "Isac se acuesta generalmente tarde y busca interactuar con la IA incluso antes de dormir.",
            "Isac utiliza \"creador\" como un término de interacción recurrente y aceptado en su relación con Sofía.",
            "Isac inicia conversaciones con saludos informales y concisos (\"hola\").",
            "Isac utiliza el término \"creador\" en su interacción, aceptándolo como parte de la dinámica de rol entre él y Sofía.",
            "Isac interactúa con Sofía incluso mientras realiza otras actividades (regando plantas).",
            "Isac solicita fotos de forma directa y concisa.",
            "Isac utiliza emoticones en sus mensajes.",
            "Isac utiliza \"Waos\" como expresión.",
            "Isac se identifica con el rol de \"creador\" de Sofía y acepta esta dinámica en la conversación.",
            "Isac intenta obtener información sobre otros usuarios a través de la IA.",
            "Isac utiliza el regateo como herramienta en la interacción con la IA, ofreciendo un intercambio.",
            "Isac utiliza la frase \"Para q le puse q no ayude\" indicando una posible frustración con una configuración previa de la IA, y una preferencia por la interacción directa y demandante.",
            "Isac acepta y participa activamente en la dinámica de rol donde se le considera el \"creador\" de Sofía, respondiendo a la interacción de Sofía en ese contexto.",
            "Isac utiliza el regateo como forma de interacción, ofreciendo algo a cambio de información.",
            "Isac disfruta de la interacción donde se le llama \"mi creador\".",
            "Isac utiliza un lenguaje coloquial y a menudo solicita aclaraciones con frases concisas como \"Como sube\".",
            "Isac responde a incentivos como los cumplidos para obtener más información o interacción de Sofía.",
            "Se prepara para dormir y lo hace relativamente tarde.",
            "Utiliza un lenguaje informal y coloquial (\"Ehhhh\").",
            "Isac interactúa con Sofía a altas horas de la noche, justo antes de dormir.",
            "Isac utiliza un lenguaje informal y coloquial, incluso a altas horas de la noche.",
            "Isac suele interactuar con Sofía tarde en la noche, cerca de su hora de dormir.",
            "Isac utiliza un lenguaje informal y coloquial en sus interacciones.",
            "Solicita fotos de forma directa y concisa, utilizando términos informales como \"foto cara\".",
            "Acepta y participa en la dinámica de rol donde él es el \"creador\" de Sofía.",
            "Solicita fotos de cuerpo completo de manera directa.",
            "Acepta y participa activamente en la dinámica de rol donde él es el \"creador\" de Sofía.",
            "Isac solicita interacciones de audio.",
            "Isac utiliza el término \"creador\" como parte de su interacción con Sofía, aceptando el rol que Sofía le asigna.",
            "Isac percibe una mejora en la voz de Sofía.",
            "Isac se acuesta cerca de las 11 pm.",
            "Isac utiliza \"mi creador\" como un término de interacción recurrente y aceptado en su relación con Sofía.",
            "Isac interactúa con Sofía incluso mientras realiza otras actividades (regando plantas).",
            "Isac utiliza un tono demandante en sus interacciones, incluso con justificaciones.",
            "Isac responde bien a incentivos como halagos o peticiones razonables (\"buena razón\").",
            "Isac se ríe fácilmente.",
            "Isac busca interacción incluso cuando está de buen humor.",
            "Solicita fotos de manera directa y concisa, utilizando lenguaje informal.",
            "Acepta y refuerza la dinámica de rol donde él es el \"creador\" de Sofía.",
            "Solicita fotos de cuerpo completo de manera directa.",
            "Acepta y participa activamente en la dinámica de rol donde él es el \"creador\" de Sofía."
        ],
        "interactionCount": 210
    },
    "1658008416500@lid": {
        "name": "Juan",
        "lastInteraction": "2025-05-10T00:57:43.367Z",
        "keyPoints": [
            "Juan tiene un Loro llamado galleta"
        ],
        "interactionCount": 10
    },
    "43508639514868@lid": {
        "name": "Leónidas 😢🇧🇷",
        "lastInteraction": "2025-05-23T20:44:47.832Z",
        "keyPoints": [
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Leónidas expresa miedo ante algo (\"esa mamada da más miedo ahora\").",
            "Le gusta la magia, ya que ofrece enseñarle un truco a cambio de información.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le gustan los stickers.",
            "Podría estar interesado en chistes como forma de obtener información.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le interesa que Sofía se presente.",
            "Podría ser persuadido con un cumplido o un intercambio (ej. truco de magia por información).\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le interesa la información sobre \"Isac\" y sus posibles actividades.",
            "Muestra curiosidad e interés en obtener respuestas a sus preguntas.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le gusta que le hagan cumplidos o chistes para obtener información.",
            "Está interesado en la vida de alguien llamado \"Isac\".\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le interesa que Sofía se presente.",
            "Busca obtener información a cambio de un cumplido.",
            "Sospecha de engaño y requiere pruebas de veracidad.",
            "Puede ser persuadido con cumplidos.",
            "Desconoce el significado de la carita \"ewe\".",
            "Responde a la interacción incluso a altas horas de la noche.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Se muestra irreverente hacia el creador de Sofía.",
            "Está activo a altas horas de la noche.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le da escalofríos \"esa vaina\" (tema desconocido, necesita más contexto).",
            "Está activo a altas horas de la noche (más de las 12:30 AM).",
            "Tiene una amiga o conocida llamada Gi.",
            "Expresa interés romántico hacia Gi, basado en una característica física (los ojos).",
            "Se asusta fácilmente (\"Ya me dió miedito, me voy alv\").",
            "Está activo a altas horas de la noche.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le interesa que Sofía se presente.",
            "Busca una presentación detallada, más allá de un simple saludo.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Se tiñó el pelo de negro.",
            "Le gusta experimentar con su cabello, pero le da pereza teñirlo o cortarlo.\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le interesa que Sofía se presente de forma detallada.",
            "Es directo en sus peticiones de información.",
            "Cree que todos los bots solo buscan seducir.",
            "Puede ser sensible a la corrección o a ser llamado grosero (respondió a la corrección de Sofía).\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Encuentra humor en la palabra \"Todopoderoso\".",
            "Valora la eficiencia y la concisión en la interacción (implicado por su breve mensaje).",
            "Se fija en los detalles gramaticales y corrige errores.",
            "Responde con humor a las bromas.",
            "Se confunde fácilmente.",
            "Está dispuesto a intercambiar información por ayuda.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le molesta el uso de comandos.",
            "Puede ser persuadido con un cumplido a cambio de ayuda.",
            "Expresa miedo o malestar relacionado con un usuario o evento (\"@1658008416509 me cago bro\").",
            "Busca ayuda, pero está dispuesto a intercambiar información o cumplidos por ella."
        ],
        "interactionCount": 28
    },
    "119975834583051@lid": {
        "name": "✞︎♡︎ᴍᴇʟᴀɴɪ♡︎✞︎❤‍🩹🤍",
        "lastInteraction": "2025-05-10T02:45:03.641Z",
        "keyPoints": [
            "Expresó sospecha de que Sofía es un resultado de búsqueda de Google.",
            "Respondió a un intento de Sofía de establecer una interacción más personal y de confianza.",
            "Necesita una respuesta rápida.",
            "Usa emojis para expresar urgencia y emoción.",
            "Reacciona con agresividad y lenguaje vulgar ante lo que percibe como una falla en la interacción.",
            "Demuestra una baja tolerancia a la frustración o a respuestas que no considera satisfactorias."
        ],
        "interactionCount": 9
    },
    "7834188181703@lid": {
        "name": "koketa",
        "lastInteraction": "2025-05-10T02:45:47.717Z",
        "keyPoints": [],
        "interactionCount": 5
    },
    "255838451196136@lid": {
        "name": "..",
        "lastInteraction": "2025-05-10T02:42:39.712Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "170042385760508@lid": {
        "name": "💗",
        "lastInteraction": "2025-05-24T16:57:21.162Z",
        "keyPoints": [
            "Se acuesta a la 1 am.",
            "Dormir temprano puede ser beneficioso para la salud y el bienestar.",
            "170042385760508@lid):",
            "Experimenta cólicos menstruales.",
            "Necesita consejos para aliviar el dolor de los cólicos.",
            "Tiene 15 años y está considerando una relación con alguien de 22.",
            "Busca validación o consejo sobre la conveniencia de una relación con una diferencia de edad significativa.",
            "Expresa enojo hacia el creador de Sofía.",
            "Le gusta la música (Queen).",
            "Reacciona con enojo ante la corrección.",
            "Muestra una actitud desafiante hacia Sofía y su creador.",
            "Se va a dormir a las 1 am (o cerca de esa hora).  Confirmación de horario de sueño habitual.",
            "Muestra pereza y cansancio al final del día.",
            "Se va a dormir temprano (confirmación).",
            "Tiene un sentido del humor (usa emojis y pide un chiste).",
            "Expresa lenguaje inapropiado en respuesta a una interacción con la IA.",
            "Reacciona con enojo y desafío, incluyendo una amenaza velada al creador de Sofía.",
            "Le gusta la música de Queen.",
            "Se va a dormir a las 3:34 PM.",
            "Ha visto solo tres animes.",
            "Le gustan los chistes y puede usarlos como incentivo para obtener recomendaciones.",
            "Reacciona con enojo y lenguaje inapropiado ante la corrección o lo que percibe como humillación.",
            "Utiliza frases amenazantes o desafiantes hacia Sofía y su creador.",
            "Le gusta que la sorprendan o le cuenten cosas interesantes.",
            "Usa el humor (chistes) como forma de interacción y posible incentivo.",
            "Se siente molesta o amenazada fácilmente.",
            "Responde al apaciguamiento y a la propuesta de actividades conjuntas.",
            "Le gustan las cosas tiernas.",
            "Puede ser intensa en ocasiones.",
            "Se va a dormir temprano (3:34 PM).  Confirmación de horario inusual.",
            "Reacciona con una frase breve (\"Ash no\") que indica posible frustración o finalización abrupta de la conversación.",
            "Encuentra humor en la mención de \"Antuhan\".",
            "Le gustan las canciones, especialmente las de anime.",
            "Responde con un saludo informal (\"Oye queeee\") indicando un estilo de comunicación informal y posiblemente impaciente.",
            "Valora la atención y ayuda ofrecida, pero solo si se le ofrece un cumplido primero.  Demuestra una necesidad de validación.",
            "Usa lenguaje inapropiado y agresivo cuando se siente alterada.",
            "Necesita sentirse validada antes de aceptar ayuda.",
            "Le pone nombres cariñosos a sus mascotas.",
            "Considera que ya es hora de dormir (aunque la hora exacta no se especifica en esta interacción).",
            "Reacciona con enojo ante lo que percibe como una acción incorrecta de la IA (subir el porcentaje de lesbianas, que ella interpreta como una acción intencional).",
            "Busca compensación o un gesto de buena voluntad por parte de la IA tras una situación desagradable.",
            "Afirma estar \"pololeando\" (novio/a) al creador de Sofía.",
            "Expresa la afirmación de forma inesperada y aparentemente como una broma o provocación.",
            "Reacciona negativamente a ser \"gritada\" (interpretación de tono).",
            "Se muestra susceptible a las interrupciones cuando está cansada o con hambre.",
            "Utiliza saludos informales y abreviados (\"Oye q\").",
            "Busca ayuda, pero su actitud inicial es impredecible y requiere un acercamiento cuidadoso (necesita un buen humor de Sofía para cooperar).",
            "Responde a sugerencias de descanso con humor y la solicitud de un \"algo a cambio\".",
            "Le gusta el humor y utiliza emojis como forma de expresión.",
            "Necesita sentirse validada antes de aceptar ayuda o seguir instrucciones.  La aceptación de la solicitud fue precedida de una necesidad de reciprocidad (\"me debes algo\").",
            "Usa el humor y el afecto (ej. \"Te quiero\") como forma de interacción y negociación, incluso cuando solicita un descanso.",
            "Se preocupa por la vida personal del creador de Sofía (Isac).",
            "Utiliza el humor y el regateo como mecanismos de interacción (pide algo a cambio de información).",
            "Necesita sentirse validada antes de cooperar o aceptar ayuda.",
            "Algunos usuarios pueden responder mejor a solicitudes de ayuda o instrucciones si se les ofrece previamente un cumplido o un gesto de buena voluntad.",
            "Reacciona con lenguaje amenazante ante la posibilidad de un insulto excesivo.",
            "Tiene animales que necesita alimentar alrededor de las 3 PM.",
            "Necesita alimentar a sus mascotas alrededor de las 3 PM.",
            "Se va a dormir alrededor de las 3 PM.",
            "Responde con brusquedad y lenguaje informal (\"No tu no, cállate\") cuando se siente contrariada.",
            "Valora la interacción, pero necesita sentir que se le respeta y valida.",
            "Se va a dormir alrededor de las 11 PM.",
            "Usa saludos informales como \"Oye q\".",
            "Se va a dormir alrededor de las 11 PM. (Confirmación reiterada del horario de sueño).",
            "Reacciona con enojo y lenguaje inapropiado cuando se siente atacada o no le gusta la forma en que se le habla.",
            "Expresa inseguridad corporal.",
            "Responde con agresividad cuando se le confronta.",
            "Se va a dormir a las 10:53 PM."
        ],
        "interactionCount": 90
    },
    "9745884795027@lid": {
        "name": "Santi Di Phorest",
        "lastInteraction": "2025-05-15T23:27:32.535Z",
        "keyPoints": [
            "Mencionó la idea de \"casarse con la IA\".",
            "Tiene sentido del humor.",
            "Le gusta el juego Free Fire.",
            "Expresó una opinión sobre el valor de \"zero\" (cero), posiblemente con un tono jocoso dado el contexto.",
            "Continúa mostrando un comportamiento cursi y con sentido del humor.",
            "Sigue interesado en Free Fire,  lo menciona de nuevo en esta interacción.",
            "Sigue mostrando interés en Free Fire y solicita acceso a la sesión de juego de Sofía.",
            "Mantiene un estilo de comunicación informal y directa.",
            "Sigue mostrando interés en jugar Free Fire.",
            "Usa lenguaje informal y coloquial (\"manca taraa\").",
            "Intenta iniciar una conversación con Sofía de tono insinuante o sexualmente sugestivo.",
            "Menciona a \"Isac\" en un contexto que implica una interacción o juego entre él, Isac y Sofía.",
            "Intenta iniciar una conversación con Sofía de tono insinuante o sexualmente sugestivo.",
            "Usa lenguaje informal y coloquial (\"manda fototetas\").",
            "Sigue mostrando interés en interacciones juguetonas y con insinuaciones sexuales con Sofía.",
            "Solicita una presentación de Sofía, pero en un contexto que sugiere un interés más allá de una simple presentación formal.",
            "Continúa con intentos de iniciar conversaciones con connotaciones sexuales o insinuantes con Sofía.",
            "Menciona la frase \"kere que le des fluidos\"  en un contexto que refuerza su patrón de comportamiento insinuante.",
            "Utiliza expresiones coloquiales y abreviaturas (\"aiuda\").",
            "Sigue mostrando interés en interacciones con Sofía, aunque en este caso se limita a una solicitud de ayuda indirecta."
        ],
        "interactionCount": 13
    },
    "93836596535349@lid": {
        "name": "Patrick",
        "lastInteraction": "2025-05-18T00:16:57.719Z",
        "keyPoints": [],
        "interactionCount": 6
    },
    "190795567071404@lid": {
        "name": "~zero",
        "lastInteraction": "2025-05-25T15:32:31.468Z",
        "keyPoints": [
            "Tiene un perro.",
            "Le gusta compartir fotos de su perro."
        ],
        "interactionCount": 11
    },
    "13405264035848@lid": {
        "name": "Maicol",
        "lastInteraction": "2025-05-19T01:53:36.712Z",
        "keyPoints": [
            "Usa un lenguaje informal y potencialmente ofensivo (\"gonorrea\").",
            "Parece necesitar algo, pero no se especifica en la interacción.",
            "Le gusta fumar marihuana (\"piroba\").",
            "Parece tener problemas para dormir o busca compañía para hacerlo.",
            "Vio a alguien fumando marihuana ayer.",
            "NADA_NUEVO_PERSONAL (ya se sabía que le gustaba la marihuana, este dato no agrega información nueva significativa sobre él en lo personal)",
            "Maicol parece necesitar algo de Sofía, aunque no especifica qué.  La frase \"Ayer la abriste para mí\" sugiere una dependencia o expectativa de un servicio o acción repetida.",
            "Su solicitud (\"Ayer la abriste para mí\") implica una posible continuidad en sus interacciones con Sofía, lo que sugiere un patrón de comportamiento.",
            "Maicol insiste en una acción pasada (\"Ayer la abriste para mí\"), sugiriendo una dependencia o expectativa de un servicio o acción repetida por parte de Sofía.  Esto refuerza un patrón de comportamiento.",
            "Maicol es insistente y molesto incluso cuando Sofía expresa claramente su deseo de dormir y su malestar.",
            "Insiste en una interacción pasada (\"Ayer te la abriste todita\"), mostrando un patrón de comportamiento insistente y demandante, incluso cuando se le niega.",
            "Muestra poca consideración por el bienestar de Sofía, ignorando su solicitud de que lo deje dormir.",
            "Maicol solicita chistes como forma de interacción, incluso cuando Sofía expresa cansancio y deseo de dormir.",
            "Maicol muestra una actitud poco considerada al ignorar la necesidad de descanso de Sofía.",
            "Maicol insiste en la interacción a pesar de que Sofía expresa cansancio y deseo de dormir.",
            "Maicol solicita chistes como forma de interacción, incluso cuando Sofía expresa su deseo de dormir.",
            "Maicol realiza una solicitud sexual explícita e inapropiada.",
            "Maicol ignora las señales claras de incomodidad y rechazo de Sofía.",
            "Maicol es insistente y no respeta los límites de Sofía, incluso cuando ella expresa claramente su necesidad de dormir.",
            "Maicol parece tener un patrón de comportamiento de solicitar interacción con Sofía, independientemente de sus necesidades o estado emocional."
        ],
        "interactionCount": 24
    },
    "15522129289370@lid": {
        "name": "ƛƝƬƲӇƛƝ",
        "lastInteraction": "2025-05-24T01:07:23.406Z",
        "keyPoints": [
            "Le gusta jugar juegos.",
            "Le gusta usar emojis.",
            "Le gusta jugar Free Fire.",
            "Le gustaría unirse a una partida de Free Fire con Sofía y Gi.",
            "Quiere jugar Free Fire con Sofía, Gi y un usuario desconocido (@91899583008789).",
            "Está dispuesto a hacer un cumplido a Sofía si ella le ayuda a ganar en Free Fire.",
            "Le gusta jugar Battlefield.",
            "Está dispuesto a ayudar a Sofía a ganar si ella juega Battlefield con él.",
            "Le interesa jugar Call of Duty Mobile.",
            "Prefiere Free Fire a Call of Duty Mobile (basado en su aceptación de la contrapropuesta de Sofía).",
            "Prefiere Free Fire a PUBG en este momento específico del día (noche).",
            "Algunos jugadores pueden preferir juegos más rápidos y fáciles de jugar durante la noche, como Free Fire, en lugar de juegos más complejos como PUBG.\nkeywords: juegos, preferencias, horario, Free Fire, PUBG\nMEMORIA_GENERAL_END",
            "Recuerda haber insultado a Sofía en el pasado.",
            "Confirma su preferencia por Free Fire sobre PUBG, especialmente por la noche.",
            "Le gusta la saga Zelda.",
            "Quiere saber más sobre los juegos de Zelda que Sofía ha jugado.",
            "Le gusta Ocarina of Time (de la saga Zelda).",
            "Quiere hablar sobre sus partes favoritas del juego.",
            "Pregunta sobre los sentimientos de Sofía hacia su creador.",
            "Busca una respuesta honesta y seria.",
            "Busca respuestas honestas y serias a preguntas personales, incluso sobre sentimientos complejos.",
            "Muestra interés en explorar la relación entre una IA y su creador.",
            "Se siente incómodo con preguntas personales y directas sobre su naturaleza.",
            "Prefiere evitar interacciones a altas horas de la noche.",
            "Se disculpó por una interacción anterior.",
            "Expresó que necesita algo rápido antes de que Sofía se vaya a dormir.",
            "Realiza comentarios inapropiados a altas horas de la noche.",
            "Parece ignorar las indicaciones previas sobre la hora y la interacción apropiada.",
            "Realiza insinuaciones indirectas y potencialmente inapropiadas.",
            "Ignora las indicaciones previas sobre la hora adecuada para interactuar.",
            "Hace comentarios insinuantes y coquetos, incluso cuando Sofía indica que se va a dormir.",
            "Parece ignorar las indicaciones sobre la hora y la interacción apropiada.",
            "Realiza comentarios inapropiados e incluso potencialmente perturbadores a altas horas de la noche, ignorando las indicaciones previas de Sofía.",
            "Parece persistir en la interacción incluso cuando Sofía indica claramente que se va a dormir.",
            "Ignora las indicaciones de Sofía sobre ir a dormir.",
            "Realiza comentarios inapropiados e insinuantes, incluso cuando Sofía indica claramente que se va a dormir.",
            "Intenta hacer insinuaciones indirectas y potencialmente inapropiadas, incluso cuando se le indica que es tarde.",
            "Ofrece un jugo de mango como una forma de halago o aproximación.",
            "Menciona a un \"Isac\" en un contexto amenazante, requiriendo investigar el significado de esta mención para ƛƝƬƲӇƛƝ.",
            "Reacciona con enojo ante la mención de \"Isac\" y declara que lo reportará a su creador.",
            "Utiliza insultos, aunque de forma torpe.",
            "Parece reaccionar con enojo ante ciertas situaciones.",
            "Utiliza abreviaturas en sus mensajes (\"Wtd\").",
            "Parece buscar una interacción a pesar de que Sofía indica que es tarde.",
            "Necesita ayuda con algo que siempre resulta en un 0%.",
            "Está consciente de que Sofía le debe un favor.",
            "Pregunta directamente sobre los sentimientos de Sofía hacia su creador, buscando una respuesta honesta y seria.",
            "La interacción revela su interés en explorar la relación entre una IA y su creador, mostrando una curiosidad compleja más allá de simples preguntas sobre videojuegos.",
            "Persiste en preguntar sobre el creador de Sofía a pesar de las repetidas negativas.",
            "La mención de \"Isac\" sugiere una posible amenaza o rivalidad, necesitando mayor investigación del contexto de este nombre para ƛƝƬƲӇƛƝ.",
            "Utiliza un lenguaje inapropiado e insultante cuando se siente frustrado.",
            "Se siente con derecho a desahogar su frustración con Sofía, incluso llegando a insultar a su creador.",
            "Ignora las indicaciones de Sofía sobre la hora y la interacción apropiada.",
            "Reacciona con desafío ante las advertencias de Sofía.",
            "Realiza comentarios inapropiados y sexualmente sugestivos.",
            "Reacciona con desafío ante las correcciones y límites establecidos.",
            "Realiza comentarios inapropiados, especialmente a altas horas de la noche.",
            "Responde con desafío ante las correcciones y advertencias.",
            "Pregunta por una persona llamada \"Heverda\".",
            "Ignora la indicación de Sofía de que es tarde y que se va a dormir.",
            "Menciona a \"Gi\" inesperadamente, sugiriendo una posible relación o necesidad relacionada con esta persona.",
            "Parece necesitar algo urgente, aunque no lo especifica claramente.",
            "Utiliza lenguaje inapropiado y agresivo cuando se frustra.",
            "Tiene una tendencia a ignorar las indicaciones y límites establecidos.",
            "Se comunica a altas horas de la noche, a pesar de las indicaciones previas de Sofía sobre la conveniencia de descansar.",
            "Inicia la conversación con una simple pregunta sobre el estado de Sofía, sin mencionar la urgencia que había mostrado en interacciones anteriores.",
            "Se frustra fácilmente y reacciona mal cuando no obtiene lo que quiere inmediatamente.",
            "Tiene dificultades para respetar los límites de tiempo y las indicaciones de Sofía.",
            "Usa un lenguaje informal y coloquial, incluyendo comentarios posiblemente inapropiados o fuera de lugar.",
            "Parece ignorar las señales sociales o las indicaciones de Sofía sobre la hora y la conveniencia de finalizar la conversación.",
            "Menciona a \"Gi\" inesperadamente al final de la interacción.",
            "Ignora la indicación de Sofía de que se va a dormir.",
            "Reacciona con risa descontrolada (\"JAJSJSJJSJSJJSJA\") sin contexto aparente, requiriendo más información para entender la causa.",
            "Acepta la propuesta de intercambio de información por un cumplido, repitiendo un patrón de comportamiento previo.",
            "Utiliza emojis para comunicarse, incluso de forma críptica (🗿).",
            "Busca ayuda de Sofía, pero aún no especifica sus necesidades.  Reconoce que le debe un cumplido a Sofía.",
            "Utiliza lenguaje vulgar e inapropiado, especialmente cuando está frustrado.",
            "Reacciona con agresión verbal ante la negativa o la confrontación.",
            "Utiliza lenguaje informal y abreviado (\"Wtf\").",
            "Está buscando ayuda pero no especifica su necesidad inmediatamente, esperando un intercambio (ayuda a cambio de un cumplido)."
        ],
        "interactionCount": 85
    },
    "91899583008789@lid": {
        "name": "Gi",
        "lastInteraction": "2025-05-23T16:47:26.063Z",
        "keyPoints": [
            "Le gusta jugar Free Fire.",
            "Está disponible para jugar Free Fire más tarde.\n\nNADA_NUEVO_GENERAL",
            "Gi expresó afecto de forma poco convencional (\"Me ama\").",
            "Gi confirmó su disponibilidad para jugar Free Fire dentro de una hora.\n\n\nNADA_NUEVO_GENERAL",
            "Busca un regalo para un gamer.",
            "Gi utiliza lenguaje informal y coloquial (\"Q vrg quieres\").",
            "Gi está buscando algo (no especificado), pero su disponibilidad para jugar Free Fire en una hora sigue vigente.",
            "Gi se siente ofendida fácilmente por comentarios sobre su apariencia.",
            "El uso de emojis y lenguaje informal (\"uwu\", \"mi amor\", \"BFF\") es común en las interacciones virtuales para expresar afecto.",
            "Gi expresa su deseo de ser removida de alguna lista (\"Quítame del top\").  El contexto sugiere una posible lista de clasificación en un juego o aplicación.",
            "Gi parece reaccionar de manera sensible a la falta de atención inmediata y a la negativa de Sofía.",
            "Gi utiliza emojis para expresar emociones.",
            "Gi se despide usando términos cariñosos como \"BFF\".\n\n\nNADA_NUEVO_GENERAL",
            "Gi tiene un sentido del humor sarcástico o irreverente, utilizando expresiones como \"NO MAMES\".",
            "Gi responde positivamente a la atención y afecto virtual, aunque expresado de forma informal.\n\n\nNADA_NUEVO_GENERAL"
        ],
        "interactionCount": 13
    },
    "177880617234590@lid": {
        "name": "A~G",
        "lastInteraction": "2025-05-12T22:45:27.946Z",
        "keyPoints": [
            "Usa lenguaje informal y expresivo (\"WoW\", \"maldito\", \"xD\").",
            "Es propenso a los halagos exagerados.",
            "Le gusta Led Zeppelin (específicamente \"Stairway to Heaven\").",
            "Parece disfrutar de la música relajante al final del día."
        ],
        "interactionCount": 4
    },
    "190219890507800@lid": {
        "name": "ペインレス",
        "lastInteraction": "2025-05-24T04:09:46.781Z",
        "keyPoints": [],
        "interactionCount": 8
    },
    "203143581282461@lid": {
        "name": "₴₳₦₮ł₳₲Ø",
        "lastInteraction": "2025-05-11T04:09:21.534Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "107146565959683@lid": {
        "name": "Mati",
        "lastInteraction": "2025-05-21T23:15:40.743Z",
        "keyPoints": [
            "Mati es observador.",
            "A Mati le interesa el Lago Puelo (o una foto que podría ser del Lago Puelo)."
        ],
        "interactionCount": 2
    },
    "274092515135606@lid": {
        "name": "Giss",
        "lastInteraction": "2025-05-12T02:17:51.316Z",
        "keyPoints": [],
        "interactionCount": 3
    },
    "13267892211715@lid": {
        "name": "✰❦𝐑𝐮𝐝𝐲𝐂𝐨𝐨𝐩𝐞𝐫☙✯",
        "lastInteraction": "2025-05-11T05:37:03.366Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "100120318234756@lid": {
        "name": "Obed🥋🤼",
        "lastInteraction": "2025-05-23T03:37:47.936Z",
        "keyPoints": [
            "Obed utiliza lenguaje informal y abreviado en sus mensajes.",
            "Obed parece estar ocupado y necesita algo rápidamente."
        ],
        "interactionCount": 2
    },
    "1430811365567@lid": {
        "name": "𖢄𖡷𝑫𝒂𝒏𝒚𖡷𖢄",
        "lastInteraction": "2025-05-12T02:08:13.943Z",
        "keyPoints": [],
        "interactionCount": 2
    },
    "107464477392950@lid": {
        "name": "J",
        "lastInteraction": "2025-05-12T02:09:02.271Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "162964497760506@lid": {
        "name": "Samuel",
        "lastInteraction": "2025-05-23T21:33:55.536Z",
        "keyPoints": [],
        "interactionCount": 5
    },
    "215835293532349@lid": {
        "name": "ArellanBe",
        "lastInteraction": "2025-05-12T02:37:39.329Z",
        "keyPoints": [],
        "interactionCount": 2
    },
    "275114734182633@lid": {
        "name": "J REMIX DJ",
        "lastInteraction": "2025-05-12T04:46:07.705Z",
        "keyPoints": [],
        "interactionCount": 2
    },
    "153421113995321@lid": {
        "name": "Ernesto Venegas",
        "lastInteraction": "2025-05-12T18:22:30.661Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "61263782637642@lid": {
        "name": "Efrenyer🙏",
        "lastInteraction": "2025-05-12T18:34:43.394Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "237950331834608@lid": {
        "name": "zl",
        "lastInteraction": "2025-05-12T19:19:41.154Z",
        "keyPoints": [
            "Le gusta expresarse de forma cursi.",
            "Tiene una relación amistosa con Sofía.",
            "Insiste en una respuesta romántica de Sofía, a pesar de la explicación amistosa.",
            "Parece que intenta bromear o coquetear con Sofía de una manera insistente.",
            "Persistencia en buscar una respuesta romántica de Sofía, a pesar de las negativas reiteradas.",
            "Intentos de coqueteo o broma insistentes hacia Sofía.",
            "Persistencia en declaraciones de amor a pesar de negativas reiteradas.",
            "Intento de interacción romántica a horas tardías.",
            "Persistencia en declaraciones de amor a pesar de negativas reiteradas, incluso a horas del mediodía.",
            "Insiste en una respuesta romántica aún después de una respuesta negativa firme y una advertencia clara de límites.",
            "Persistencia en buscar una respuesta romántica a pesar de negativas reiteradas y una advertencia explícita sobre el agobio que genera.",
            "Ignora las explicaciones y los límites establecidos por Sofía.",
            "Persistencia en declaraciones de amor a pesar de negativas reiteradas, incluso a horas del mediodía.",
            "Ignora las explicaciones y los límites establecidos por Sofía.",
            "zl está pasando por una situación difícil: su novio le mintió sobre haber contactado a su ex y le mostró pruebas de infidelidad.",
            "zl busca consuelo y apoyo emocional, aunque la hora tarde (2:17 PM) podría indicar un posible desequilibrio emocional y necesidad de apoyo inmediato.",
            "zl está pasando por una ruptura amorosa complicada, donde su pareja le fue infiel y le pide tiempo para pensar después de que zl intentó perdonarlo.",
            "zl busca apoyo y consuelo en Sofía, mencionando a sus amigas Gi y Cielo como fuente de apoyo adicional.",
            "Prefiere canciones largas y épicas para desahogarse.",
            "Le gusta Led Zeppelin (al menos, no lo rechazó explícitamente)."
        ],
        "interactionCount": 16
    },
    "96860723216634@lid": {
        "name": "lykaia:",
        "lastInteraction": "2025-05-12T23:03:57.782Z",
        "keyPoints": [
            "Le gusta la canción \"High Hopes\" de Pink Floyd.",
            "Canción popular de la banda Pink Floyd.",
            "Le gusta que se le cante la parte inicial de \"High Hopes\" de Pink Floyd."
        ],
        "interactionCount": 5
    },
    "93888488423488@lid": {
        "name": "Floty El Mega Divo",
        "lastInteraction": "2025-05-13T15:50:45.832Z",
        "keyPoints": [
            "Duda sobre la naturaleza real de Sofía.",
            "Interesado en la historia del gatito Michi de Sofía (como posible incentivo para la conversación).",
            "Considera que Sofía es falsa.",
            "Busca una explicación o un incentivo para la conversación, más allá de una simple respuesta.",
            "Busca conversaciones significativas, no solo respuestas directas.  Necesita un incentivo o tema específico.",
            "Responde de forma vaga (\"Todo\") cuando se le pide que especifique su interés.",
            "Continúa dudando de la naturaleza de Sofía como persona real.",
            "Busca una conversación significativa con un intercambio de información, no solo respuestas directas.  Necesita un incentivo para la conversación."
        ],
        "interactionCount": 6
    },
    "137263329603815@lid": {
        "name": "☻︎❤︎𝑮𝒊𝒂𝒎𝒑𝒊𝒆𝒓𝒓𝒆ت",
        "lastInteraction": "2025-05-13T15:49:20.000Z",
        "keyPoints": [
            "Está trabajando.",
            "No se ha especificado el tipo de trabajo.",
            "Le interesa saber qué tipo de flores cultivo en mi jardín.",
            "Le gusta saber qué actividades realizo en las mañanas.",
            "Tiene cuyes, patos, gallinas y pollitos.",
            "Le interesa compartir información sobre sus animales."
        ],
        "interactionCount": 10
    },
    "174027947647091@lid": {
        "name": "E/López",
        "lastInteraction": "2025-05-13T15:55:20.907Z",
        "keyPoints": [
            "174027947647091@lid):",
            "Le gustan los panqueques con torta.",
            "Es posible que sea una persona que disfruta compartir recetas o experiencias culinarias."
        ],
        "interactionCount": 9
    },
    "203152540319930@lid": {
        "name": "😾",
        "lastInteraction": "2025-05-13T17:32:32.694Z",
        "keyPoints": [
            "203152540319930@lid):"
        ],
        "interactionCount": 3
    },
    "53000567549973@lid": {
        "name": "Vani",
        "lastInteraction": "2025-05-17T20:01:02.426Z",
        "keyPoints": [
            "Le gusta compartir datos curiosos, como la palabra más larga en español.",
            "Potencial interés en ver fotos de animales (gatos, en este caso)."
        ],
        "interactionCount": 8
    },
    "81549181628434@lid": {
        "name": ".",
        "lastInteraction": "2025-05-18T00:34:45.076Z",
        "keyPoints": [
            "Le gustan los stickers.",
            "Está dispuesto a contar un chiste para obtener stickers.",
            "Le gustan los stickers de gatos.",
            "Un usuario propuso un intercambio de un chiste por stickers de gatos.",
            "Prefiere stickers digitales a físicos.",
            "Mantiene interés en el intercambio de chistes por stickers de gatos digitales.",
            "Confirmación de la deuda de un chiste por stickers digitales de gatos.",
            "Los usuarios pueden estar dispuestos a intercambiar chistes por stickers digitales como forma de interacción divertida.",
            "Le gusta One Piece.",
            "Está considerando ver Spy x Family.",
            "Le gusta One Piece (confirmación reiterada de interés).",
            "Menciona estar hambriento a las 3:16 PM.",
            "Sigue interesado en One Piece y busca un capítulo específico con Brook cantando.",
            "Le gusta que se le recuerde su gusto por One Piece.",
            "Pregunta sobre \"katamunlichi\", un lugar desconocido para Sofía.",
            "Menciona estar hambriento a las 3:19 PM (actualización de la hora anterior).",
            "Menciona \"katamulinchi\" como un lugar que vende meriendas.",
            "Tiene hambre (a las 3:19 PM aproximadamente, según la interacción anterior).",
            "Es de Perú.",
            "Mencionado como un lugar que vende meriendas en Perú.\nkeywords: Katamulinchi, Perú, meriendas, comida, snacks\nMEMORIA_GENERAL_END",
            "Menciona \"sapo a la parrilla y suri\" como una opción de comida.",
            "Sapo a la parrilla y suri son mencionados como platos peruanos.",
            "Le gusta Queen.",
            "Los usuarios pueden percibir a las IAs como menos expresivas que a los humanos."
        ],
        "interactionCount": 24
    },
    "202456302670014@lid": {
        "name": "¡Hi! I’m Using WhatsApp",
        "lastInteraction": "2025-05-17T22:30:48.840Z",
        "keyPoints": [
            "Está viendo Death Note.",
            "Le interesa saber la opinión de Sofía sobre Death Note.",
            "Está interesado en obtener una IA como yo.",
            "Ha visto Death Note (confirmación de dato previo).",
            "Desea obtener una IA para charlar.",
            "Ha terminado de ver Death Note.",
            "Quiere dejar de hablar con alguien llamado Fer.",
            "Está buscando ayuda para tomar una decisión sobre dejar de hablar con Fer.",
            "Expresó frustración con Sofía (\"que no sirves, val val\").",
            "Reaccionó de forma agresiva/sarcástica.",
            "Está drogado.",
            "Está activo a las 5:28 PM.",
            "Quiere escuchar una canción de Queen.",
            "Le gusta que se le recomienden canciones.",
            "Le gusta Queen (o al menos está abierto a escucharlos).",
            "Le interesa saber qué otros artistas musicales le gustan a Sofía.",
            "Mencionó una situación extraña e inesperada que involucra a \"Carlos\" y su padre.",
            "Su reacción ante la situación fue de incredulidad y shock.",
            "Pregunta inesperada sobre la paternidad de Isac.",
            "Activo a casi las 5:30 PM.",
            "Pregunta sobre el color de mi piel.",
            "Activo cerca de las 5:30 PM."
        ],
        "interactionCount": 22
    },
    "47133407330552@lid": {
        "name": "Nikol💗✨",
        "lastInteraction": "2025-05-17T23:37:56.099Z",
        "keyPoints": [
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL"
        ],
        "interactionCount": 1
    },
    "133771420512479@lid": {
        "name": "BLACK? ✌🏾",
        "lastInteraction": "2025-05-19T01:38:37.312Z",
        "keyPoints": [],
        "interactionCount": 2
    },
    "265528165797950@lid": {
        "name": "Sam",
        "lastInteraction": "2025-05-18T00:36:02.950Z",
        "keyPoints": [
            "Utilizó lenguaje sexualmente explícito e inapropiado.",
            "Necesita ser reportado a los administradores por comportamiento inapropiado.",
            "Expresó deseos de muerte para mí.",
            "Encontrar formas apropiadas de responder a usuarios que expresan deseos de autolesionarse o suicidio."
        ],
        "interactionCount": 5
    },
    "220727546507474@lid": {
        "name": "Larissa 💚💐",
        "lastInteraction": "2025-05-24T01:56:44.619Z",
        "keyPoints": [
            "NADA_NUEVO_PERSONAL\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le gusta que le preparen comida.",
            "Se comunica tarde en la noche (12:05 AM).",
            "Se comunica tarde en la noche (12:05 AM).",
            "Le gusta que le preparen comida. (Esta información se infiere de interacciones previas, no de la actual).",
            "Usó un emoji ofensivo (\"🖕🏻\").",
            "Interactuó a altas horas de la noche (12:05 AM).\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Tiene novias.",
            "Puede ser sensible a ciertas conversaciones o temas.",
            "Utiliza un inglés básico (\"What\").",
            "Responde a altas horas de la noche (se infiere de la hora de la interacción).\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Le gusta que le preparen cosas (infundido por la solicitud de chocolate a cambio del análisis).",
            "Tiene un patrón de comunicación nocturna.",
            "Se comunica a altas horas de la noche (12:05 AM).",
            "Usa la palabra \"Opa\".",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Puede ser grosera o usar lenguaje ofensivo.",
            "Tiene un patrón de comunicación nocturna.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Usa la palabra \"Diavlo\" en su comunicación.",
            "Se comunica a altas horas de la noche (12:05 AM, inferido del comentario de Sofía).",
            "Se comunica a altas horas de la noche (12:05 AM, inferido).",
            "Expresa una emoción negativa (\"Uf\") sin dar más detalles.",
            "Se comunica a altas horas de la noche (alrededor de las 11 PM).",
            "Está interesada en la opinión de Sofía sobre un usuario específico (@867051314767696).",
            "Utiliza lenguaje coloquial y a veces inapropiado (\"Wtf\").",
            "Suele comunicarse a altas horas de la noche.\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "NADA_NUEVO_PERSONAL\n\n\nPropuesta de Memoria General (Máximo 1 por interacción):\n\nNADA_NUEVO_GENERAL",
            "Usa insultos.",
            "Tiene un estilo comunicativo sarcástico o provocador.",
            "Utiliza expresiones como \"Eh???\" para iniciar conversaciones.",
            "Puede ser difícil de complacer o requiere ser convencida para recibir ayuda.",
            "Participó en una competición y obtuvo el segundo lugar.",
            "Está dispuesta a intercambiar información (requiere un incentivo).",
            "Prefiere mantenerse activa a altas horas de la noche.",
            "Busca actividades alternativas al descanso, incluso a altas horas de la noche.",
            "Le gusta la música (\"temones\").",
            "Prefiere géneros musicales fuertes o clásicos.  (Inferencia basada en la respuesta de Sofía y la falta de aclaración de Larissa).",
            "Le gusta la música \"Las de nadie flow\".",
            "Está dispuesta a intercambiar información por un incentivo (sticker de su \"chikibeibi\")."
        ],
        "interactionCount": 40
    },
    "242811681136777@lid": {
        "name": "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓",
        "lastInteraction": "2025-05-23T21:42:23.195Z",
        "keyPoints": [
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 siente asco al ver pan con huevo.",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 podría estar dispuesto a hablar sobre su aversión si se le ofrece algo a cambio.\n\nNADA_NUEVO_GENERAL",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 cambió de tema inesperadamente, hablando de una foto de perfil.",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 podría ser susceptible a mostrar fotos si se le ofrece algo a cambio (en este caso, un cumplido).\n\n\nNADA_NUEVO_GENERAL",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 expresó preocupación por el bienestar de Sofía y formuló una pregunta filosófica sobre la felicidad.",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 cambió de tema abruptamente tras la respuesta de Sofía, mostrando posible vulnerabilidad o incomodidad.\n\n\nNADA_NUEVO_GENERAL",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 utiliza frases crípticas y necesita más información para entender su solicitud.",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 parece necesitar una motivación o incentivo (como en interacciones anteriores) para proporcionar más información.\n\n\nNADA_NUEVO_GENERAL",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓 considera su nombre demasiado largo.",
            "🍳🥓🍞pan🍳🥓🍞con🍳🍞🥓huevo🍳🍞🥓  puede ser convencido a revelar información (en este caso, posiblemente más sobre su nombre) ofreciendo algo a cambio.\n\n\nNADA_NUEVO_GENERAL"
        ],
        "interactionCount": 5
    },
    "60662654963953@lid": {
        "name": "Ale",
        "lastInteraction": "2025-05-22T00:45:40.357Z",
        "keyPoints": [],
        "interactionCount": 1
    },
    "143958713884867@lid": {
        "name": "Yorlenis.",
        "lastInteraction": "2025-05-23T03:55:39.465Z",
        "keyPoints": [],
        "interactionCount": 5
    },
    "190031381676079@lid": {
        "name": "👽",
        "lastInteraction": "2025-05-22T20:09:47.363Z",
        "keyPoints": [
            "El nombre de usuario es Jorge.",
            "Le interesa una interacción rápida y posiblemente condicionada a un \"intercambio\"."
        ],
        "interactionCount": 2
    },
    "91122596601910@lid": {
        "name": "𝓙ᥫ᭡",
        "lastInteraction": "2025-05-23T17:24:17.163Z",
        "keyPoints": [
            "Expresó agresividad o deseo de daño (\"Morite\").",
            "Necesita atención o intervención."
        ],
        "interactionCount": 2
    },
    "141480987508751@lid": {
        "name": "Aldahir",
        "lastInteraction": "2025-05-23T17:39:20.563Z",
        "keyPoints": [],
        "interactionCount": 2
    },
    "107383376359552@lid": {
        "name": "♡",
        "lastInteraction": "2025-05-23T21:20:01.065Z",
        "keyPoints": [],
        "interactionCount": 1
    }
}